//  Давайте рассмотрим несколько простых задач на разветвление(if, else) и циклы(for, while).

// ==========================================
// Задача 1: Проверка числа на четность

// Напишите функцию, которая принимает число и выводит в консоль "Четное" или "Нечетное",
//     в зависимости от того, четное это число или нет.

// ========================================
// Задача 2: Таблица умножения

// Напишите программу, которая выводит таблицу умножения для числа, введенного пользователем.

// ========================================
// Задача 3: Поиск минимального числа

// Напишите функцию, которая принимает три числа и возвращает минимальное из них.

// ========================================
// Задача 4: Факториал числа

// Напишите программу, которая вычисляет факториал числа, введенного пользователем.

// ========================================
// Задача 5: Проверка на простое число

// Напишите функцию, которая принимает число и проверяет,
//     является ли оно простым(т.е.делится только на 1 и на само себя).

// ================================================================================

// Эти задачи помогут вам отработать базовые навыки работы с разветвлениями и циклами.

// ==============================================================================

// ==============================================================================
