//    =================================================

// Задача на роботу з масивами:
// Створіть функцію findMaxNumber, яка приймає масив
//  чисел і повертає максимальне число в цьому масиві.

// function findMaxNumber(number) {}

//  ======================================================

// Задача на роботу з об'єктами:
// Створіть функцію countChars, яка приймає рядок і
// повертає об'єкт, в якому ключі - це символи з рядка,
//  а значення - їхня кількість в рядку.

// =====================================================

// Задача на роботу з циклами та розгалуженням:
// Створіть функцію isPrime, яка приймає число і повертає true,
// якщо воно просте, та false, якщо не просте.

// ============================================================

// Задача на роботу з функціями:
// Створіть функцію reverseString, яка приймає рядок і повертає
//  новий рядок, який є оберненим в зворотному порядку.

//  =============================================================

// Задача на роботу з об'єктами та рядками:
// Створіть функцію findLongestWord, яка приймає рядок
// і повертає найдовше слово в цьому рядку.

// ==========================================================
